#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`


<details><summary>Show Plan</summary>

```

module.fsx.data.aws_partition.current: Reading...
module.fsx.data.aws_caller_identity.current: Reading...
module.fsx.data.aws_ami.windows_2022_base_image: Reading...
module.fsx.data.aws_partition.current: Read complete after 0s [id=aws]
module.fsx.data.aws_caller_identity.current: Read complete after 0s [id=270129723225]
module.fsx.data.aws_iam_policy_document.fsx_key: Reading...
module.fsx.data.aws_iam_policy_document.fsx_key: Read complete after 0s [id=3191587997]
module.networking.data.aws_availability_zones.available: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=ca-central-1]
module.fsx.data.aws_ami.windows_2022_base_image: Read complete after 0s [id=ami-0f221e8087f262252]
module.networking.data.aws_iam_policy_document.generic_endpoint_policy: Reading...
module.networking.data.aws_security_group.default: Reading...
module.networking.data.aws_iam_policy_document.generic_endpoint_policy: Read complete after 0s [id=2991258920]
module.fsx.data.aws_vpc.selected: Reading...
module.networking.data.aws_security_group.default: Read complete after 0s [id=sg-066bc58d83cd70a4a]
module.networking.data.aws_iam_policy_document.dynamodb_endpoint_policy: Reading...
module.networking.data.aws_iam_policy_document.dynamodb_endpoint_policy: Read complete after 0s [id=1657688723]
module.fsx.data.aws_vpc.selected: Read complete after 1s [id=vpc-03822a35410099946]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["secret_manager"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["kms"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=2766233735]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["dynamodb"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=3788720971]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=1759994176]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=2773141372]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["secret_manager"]: Read complete after 0s [id=2052583196]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["kms"]: Read complete after 0s [id=1947548361]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["dynamodb"]: Read complete after 0s [id=2504937670]
module.networking.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=1215220413]
module.fsx.data.aws_iam_policy_document.ad_logs: Reading...
module.fsx.data.aws_iam_policy_document.ad_logs: Read complete after 0s [id=4181754098]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fsx.aws_fsx_windows_file_system.this must be replaced
-/+ resource "aws_fsx_windows_file_system" "this" {
      - aliases                           = [] -> null
      ~ arn                               = "arn:aws:fsx:ca-central-1:270129723225:file-system/fs-04bf2875306a9ca41" -> (known after apply)
      ~ daily_automatic_backup_start_time = "09:00" -> (known after apply)
      ~ dns_name                          = "amznfsxyypoqzpz.example.com" -> (known after apply)
      ~ id                                = "fs-04bf2875306a9ca41" -> (known after apply)
      ~ network_interface_ids             = [
          - "eni-0e7d524895c4bea78",
        ] -> (known after apply)
      ~ owner_id                          = "270129723225" -> (known after apply)
      ~ preferred_file_server_ip          = "10.0.146.10" -> (known after apply)
      ~ remote_administration_endpoint    = "amznfsx4uy2a3rp.example.com" -> (known after apply)
      ~ storage_type                      = "SSD" -> "HDD" # forces replacement
        tags                              = {
            "ApplicationName" = "poc-infinitt"
            "GithubOrg"       = "InfinittNA"
            "GithubRepo"      = "infinittna-aws-ollion"
            "Name"            = "infinitt-file-system"
        }
      ~ vpc_id                            = "vpc-03822a35410099946" -> (known after apply)
      ~ weekly_maintenance_start_time     = "4:05:00" -> (known after apply)
        # (12 unchanged attributes hidden)

      ~ audit_log_configuration {
          + active_directory_id               = (known after apply)
          + aliases                           = (known after apply)
          + arn                               = (known after apply)
          + automatic_backup_retention_days   = (known after apply)
          + backup_id                         = (known after apply)
          + copy_tags_to_backups              = (known after apply)
          + daily_automatic_backup_start_time = (known after apply)
          + deployment_type                   = (known after apply)
          + dns_name                          = (known after apply)
          + id                                = (known after apply)
          + kms_key_id                        = (known after apply)
          + network_interface_ids             = (known after apply)
          + owner_id                          = (known after apply)
          + preferred_file_server_ip          = (known after apply)
          + preferred_subnet_id               = (known after apply)
          + remote_administration_endpoint    = (known after apply)
          + security_group_ids                = (known after apply)
          + skip_final_backup                 = (known after apply)
          + storage_capacity                  = (known after apply)
          + storage_type                      = (known after apply)
          + subnet_ids                        = (known after apply)
          + tags                              = (known after apply)
          + tags_all                          = (known after apply)
          + throughput_capacity               = (known after apply)
          + vpc_id                            = (known after apply)
          + weekly_maintenance_start_time     = (known after apply)
        } -> (known after apply)

      ~ disk_iops_configuration {
          + active_directory_id               = (known after apply)
          + aliases                           = (known after apply)
          + arn                               = (known after apply)
          + automatic_backup_retention_days   = (known after apply)
          + backup_id                         = (known after apply)
          + copy_tags_to_backups              = (known after apply)
          + daily_automatic_backup_start_time = (known after apply)
          + deployment_type                   = (known after apply)
          + dns_name                          = (known after apply)
          + id                                = (known after apply)
          + kms_key_id                        = (known after apply)
          + network_interface_ids             = (known after apply)
          + owner_id                          = (known after apply)
          + preferred_file_server_ip          = (known after apply)
          + preferred_subnet_id               = (known after apply)
          + remote_administration_endpoint    = (known after apply)
          + security_group_ids                = (known after apply)
          + skip_final_backup                 = (known after apply)
          + storage_capacity                  = (known after apply)
          + storage_type                      = (known after apply)
          + subnet_ids                        = (known after apply)
          + tags                              = (known after apply)
          + tags_all                          = (known after apply)
          + throughput_capacity               = (known after apply)
          + vpc_id                            = (known after apply)
          + weekly_maintenance_start_time     = (known after apply)
        } -> (known after apply)
    }

  # module.fsx.aws_instance.ad_manager will be updated in-place
  ~ resource "aws_instance" "ad_manager" {
        id                                   = "i-02bc294f485fc8906"
        tags                                 = {
            "ApplicationName" = "poc-infinitt"
            "GithubOrg"       = "InfinittNA"
            "GithubRepo"      = "infinittna-aws-ollion"
            "Name"            = "poc-infinitt-dev-fsx-ad-manager"
        }
      ~ user_data                            = "98652e15dcd566ec1328943ab04dfb6883154c03" -> (known after apply)
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.fsx.aws_secretsmanager_secret_version.fsx must be replaced
-/+ resource "aws_secretsmanager_secret_version" "fsx" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:270129723225:secret:example.com/fsx/infinitt-file-system-58fhFS" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:270129723225:secret:example.com/fsx/infinitt-file-system-58fhFS|terraform-20240719192418386200000009" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240719192418386200000009" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ fsx_module        = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Pusher: @INA-pboleski, Action: `pull_request`,Workflow: `Infinitt Networking OIDC Workflow